pulsar85/esp32FTPServer/ESPFtpServer.cpp
	if (!strcmp(command, "CDUP")) {
#ifdef FTP_DEBUG
		Serial.println("CDUP");
#endif
		client.println("250 Ok. Current directory is " + String(cwdName));
	}
	//
	//  CWD - Change Working Directory
	//
	else if (!strcmp(command, "CWD")) {
#ifdef FTP_DEBUG
		Serial.println("CWD");
#endif
		char path[ FTP_CWD_SIZE];
		if (strcmp(parameters, ".") == 0)  // 'CWD .' is the same as PWD command
			client.println(
					"257 \"" + String(cwdName)
							+ "\" is your current directory");
		else {
			client.println("250 Ok. Current directory is " + String(cwdName));
		}

	}
	//
	//  PWD - Print Directory
	//
	else if (!strcmp(command, "PWD")) {
#ifdef FTP_DEBUG
		Serial.println("PWD");
#endif
		client.println(
				"257 \"" + String(cwdName) + "\" is your current directory");
	}
	//
	//  QUIT
	//
	else if (!strcmp(command, "QUIT")) {
#ifdef FTP_DEBUG
		Serial.println("QUIT");
#endif
		disconnectClient();
		return false;
	}

	///////////////////////////////////////
	//                                   //
	//    TRANSFER PARAMETER COMMANDS    //
	//                                   //
	///////////////////////////////////////

	//
	//  MODE - Transfer Mode
	//
	else if (!strcmp(command, "MODE")) {
#ifdef FTP_DEBUG
		Serial.print("MODE ");
		Serial.print(parameters);
#endif

		if (!strcmp(parameters, "S"))
			client.println("200 S Ok");
		// else if( ! strcmp( parameters, "B" ))
		//  client.println( "200 B Ok\r\n";
		else
			client.println("504 Only S(tream) is suported");
	}
	//
	//  PASV - Passive Connection management
	//
	else if (!strcmp(command, "PASV")) {
#ifdef FTP_DEBUG
		Serial.println("PASV");
#endif
		if (data.connected())
			data.stop();
		//dataServer.begin();
		//dataIp = Ethernet.localIP();
		dataIp = client.localIP();
		dataPort = FTP_DATA_PORT_PASV;
		//data.connect( dataIp, dataPort );
		//data = dataServer.available();
#ifdef FTP_DEBUG
		Serial.println("Connection management set to passive");
		Serial.println("Data port set to " + String(dataPort));
#endif
		client.println(
				"227 Entering Passive Mode (" + String(dataIp[0]) + ","
						+ String(dataIp[1]) + "," + String(dataIp[2]) + ","
						+ String(dataIp[3]) + "," + String(dataPort >> 8) + ","
						+ String(dataPort & 255) + ").");
		dataPassiveConn = true;
	}
	//
	//  PORT - Data Port
	//
	else if (!strcmp(command, "PORT")) {
#ifdef FTP_DEBUG
		Serial.println("PORT");
#endif
		if (data)
			data.stop();
		// get IP of data client
		dataIp[0] = atoi(parameters);
		char * p = strchr(parameters, ',');
		for (uint8_t i = 1; i < 4; i++) {
			dataIp[i] = atoi(++p);
			p = strchr(p, ',');
		}
		// get port of data client
		dataPort = 256 * atoi(++p);
		p = strchr(p, ',');
		dataPort += atoi(++p);
		if (p == NULL)
			client.println("501 Can't interpret parameters");
		else {

			client.println("200 PORT command successful");
			dataPassiveConn = false;
		}
	}
	//
	//  STRU - File Structure
	//
	else if (!strcmp(command, "STRU")) {
#ifdef FTP_DEBUG
		Serial.println("STRU");
#endif
		if (!strcmp(parameters, "F"))
			client.println("200 F Ok");
		// else if( ! strcmp( parameters, "R" ))
		//  client.println( "200 B Ok\r\n";
		else
			client.println("504 Only F(ile) is suported");
	}
	//
	//  TYPE - Data Type
	//
	else if (!strcmp(command, "TYPE")) {
#ifdef FTP_DEBUG
		Serial.print("TYPE ");
		Serial.print(parameters);
#endif
		if (!strcmp(parameters, "A"))
			client.println("200 TYPE is now ASII");
		else if (!strcmp(parameters, "I"))
			client.println("200 TYPE is now 8-bit binary");
		else
			client.println("504 Unknow TYPE");
	}

	///////////////////////////////////////
	//                                   //
	//        FTP SERVICE COMMANDS       //
	//                                   //
	///////////////////////////////////////

	//
	//  ABOR - Abort
	//
	else if (!strcmp(command, "ABOR")) {
#ifdef FTP_DEBUG
		Serial.println("ABOR");
#endif
		abortTransfer();
		client.println("226 Data connection closed");
	}
	//
	//  DELE - Delete a File
	//
	else if (!strcmp(command, "DELE")) {
#ifdef FTP_DEBUG
		Serial.println("DELE");
#endif
		char path[ FTP_CWD_SIZE];
		if (strlen(parameters) == 0)
			client.println("501 No file name");
		else if (makePath(path)) {
			if (!_fs.exists(path))
				client.println("550 File " + String(parameters) + " not found");
			else {
				if (_fs.remove(path))
					client.println("250 Deleted " + String(parameters));
				else
					client.println("450 Can't delete " + String(parameters));
			}
		}
	}
	//
	//  LIST - List
	//
	else if (!strcmp(command, "LIST")) {
#ifdef FTP_DEBUG
		Serial.println("LIST");
#endif
		if (!dataConnect())
			client.println("425 No data connection");
		else {
			client.println("150 Accepted data connection");
			uint16_t nm = 0;
#ifdef ESP8266
			Dir dir=_fs.openDir(cwdName);
			// if( !SPIFFS.exists(cwdName))
			//   client.println( "550 Can't open directory " + String(cwdName) );
			// else
			{
				while( dir.next())
				{
					String fn, fs;
					fn = dir.fileName();
					fn.remove(0, 1);
					fs = String(dir.fileSize());
					data.println( "+r,s" + fs);
					data.println( ",\t" + fn );
					nm ++;
				}
				client.println( "226 " + String(nm) + " matches total");
			}
#elif defined ESP32
			File root = _fs.open(cwdName);
			if (!root) {
				client.println("550 Can't open directory " + String(cwdName));
#ifdef FTP_DEBUG
				Serial.println(String(cwdName));
#endif
				// return;
			} else {
				// if(!root.isDirectory()){
				// 		Serial.println("Not a directory");
				// 		return;
				// }

				File file = root.openNextFile();
				while (file) {
					if (file.isDirectory()) {
						data.println("+r,s <DIR> " + String(file.name()));
#ifdef FTP_DEBUG
						Serial.print("  DIR : ");
						Serial.println(file.name());
#endif
						// if(levels){
						// 	listDir(fs, file.name(), levels -1);
						// }
					} else {
						String fn, fs;
						fn = file.name();
						// fn.remove(0, 1);
						fs = String(file.size());
						data.println("+r,s" + fs);
						data.println(",\t" + fn);
						nm++;
#ifdef FTP_DEBUG
						Serial.print(fn);
#endif

