pulsar85/esp32FTPServer/ESPFtpServer.cpp
					}
					file = root.openNextFile();
				}
				client.println("226 " + String(nm) + " matches total");
			}
#endif
			data.stop();
		}
	}
	//
	//  MLSD - Listing for Machine Processing (see RFC 3659)
	//
	else if (!strcmp(command, "MLSD")) {
#ifdef FTP_DEBUG
		Serial.println("MLSD");
#endif
		if (!dataConnect())
			client.println("425 No data connection MLSD");
		else {
			client.println("150 Accepted data connection");
			uint16_t nm = 0;
#ifdef ESP8266
			Dir dir= _fs.openDir(cwdName);
			char dtStr[ 15 ];
			//  if(!SPIFFS.exists(cwdName))
			//    client.println( "550 Can't open directory " +String(parameters)+ );
			//  else
			{
				while( dir.next())
				{
					String fn,fs;
					fn = dir.fileName();
					fn.remove(0, 1);
					fs = String(dir.fileSize());
					data.println( "Type=file;Size=" + fs + ";"+"modify=20000101160656;" +" " + fn);
					nm ++;
				}
				client.println( "226-options: -a -l");
				client.println( "226 " + String(nm) + " matches total");
			}
#elif defined ESP32
#ifdef FTP_DEBUG
			Serial.println(String(cwdName));
#endif
			File root = _fs.open(cwdName);
			// if(!root){
			// 		client.println( "550 Can't open directory " + String(cwdName) );
			// 		// return;
			// } else {
			// if(!root.isDirectory()){
			// 		Serial.println("Not a directory");
			// 		return;
			// }

			File file = root.openNextFile();
			while (file) {
#ifdef FTP_DEBUG
				Serial.println(String(String(file.name())));
#endif
				String fn, fs;
				if(file.isDirectory()) {

					fn = file.name();
					fn.remove(0, 1);
					//data.println( "+r,s <DIR> " + String(file.name()));
					data.println( "Type=dir;Perm=r;modify=20000101160656; " + fn);
					//data.println("Type=dir;Perm=r" + ";" + "modify=20000101160656;" + " " + String(file.name()));
					nm++;
#ifdef FTP_DEBUG
					Serial.print("  DIR : ");
					Serial.println(file.name());
#endif
					//		 	  listDir((char *)file.name());
					//if(levels){
					//	listDir(fs, file.name(), levels -1);
					//}
				} else {

					fn = file.name();
					fn.remove(0, 1);
					fs = String(file.size());
					data.println(
							"Type=file;Size=" + fs + ";" + "modify=20000101160656;"
							+ " " + fn);
					nm++;
				}
				file = root.openNextFile();
			}
			client.println("226-options: -a -l");
			client.println("226 " + String(nm) + " matches total");
			// }
#endif
			data.stop();
		}
	}
	//
	//  NLST - Name List
	//
	else if (!strcmp(command, "NLST")) {
#ifdef FTP_DEBUG
		Serial.println("NLST");
#endif
		if (!dataConnect())
			client.println("425 No data connection");
		else {
			client.println("150 Accepted data connection");
			uint16_t nm = 0;
#ifdef ESP8266
			Dir dir=_fs.openDir(cwdName);
			// if( !SPIFFS.exists( cwdName ))
			//   client.println( "550 Can't open directory " + String(parameters));
			// else
			{
				while( dir.next())
				{
					data.println( dir.fileName());
					nm ++;
				}
				client.println( "226 " + String(nm) + " matches total");
			}
#elif defined ESP32
			File root = _fs.open(cwdName);
			if (!root) {
				client.println("550 Can't open directory " + String(cwdName));
			} else {

				File file = root.openNextFile();
				while (file) {
					data.println(file.name());
					nm++;
					file = root.openNextFile();
				}
				client.println("226 " + String(nm) + " matches total");
			}
#endif
			data.stop();
		}
	}
	//
	//  NOOP
	//
	else if (!strcmp(command, "NOOP")) {
		// dataPort = 0;
#ifdef FTP_DEBUG
		Serial.println("NOOP");
#endif
		client.println("200 Zzz...");
	}
	//
	//  RETR - Retrieve
	//
	else if (!strcmp(command, "RETR")) {
#ifdef FTP_DEBUG
		Serial.print("RETR ");
		Serial.print(parameters);
#endif
		char path[ FTP_CWD_SIZE];
		if (strlen(parameters) == 0)
			client.println("501 No file name");
		else if (makePath(path)) {
			file = _fs.open(path, "r");
			if (!file)
				client.println("550 File " + String(parameters) + " not found");
			else if (!file)
				client.println("450 Can't open " + String(parameters));
			else if (!dataConnect())
				client.println("425 No data connection");
			else {
#ifdef FTP_DEBUG
				Serial.println("Sending " + String(parameters));
#endif
				client.println("150-Connected to port " + String(dataPort));
				client.println(
						"150 " + String(file.size()) + " bytes to download");
				millisBeginTrans = millis();
				bytesTransfered = 0;
				transferStatus = 1;
			}
		}
	}
	//
	//  STOR - Store
	//
	else if (!strcmp(command, "STOR")) {
#ifdef FTP_DEBUG
		Serial.print("STOR ");
		Serial.print(parameters);
#endif
		char path[ FTP_CWD_SIZE];
		if (strlen(parameters) == 0)
			client.println("501 No file name");
		else if (makePath(path)) {
			file = _fs.open(path, "w");
			if (!file)
				client.println("451 Can't open/create " + String(parameters));
			else if (!dataConnect()) {
				client.println("425 No data connection");
				file.close();
			} else {
#ifdef FTP_DEBUG
				Serial.println("Receiving " + String(parameters));
#endif
				client.println("150 Connected to port " + String(dataPort));
				millisBeginTrans = millis();
				bytesTransfered = 0;
				transferStatus = 2;
			}
		}
	}
	//
	//  MKD - Make Directory
	//
	else if (!strcmp(command, "MKD")) {
#ifdef FTP_DEBUG
		Serial.print("MKD");
		Serial.print(parameters);
#endif
		client.println("550 Can't create \"" + String(parameters)); //not support on espyet
	}
	//
	//  RMD - Remove a Directory
	//
	else if (!strcmp(command, "RMD")) {
#ifdef FTP_DEBUG
		Serial.print("RMD");
		Serial.print(parameters);
#endif
		client.println("501 Can't delete \"" + String(parameters));

	}
	//
	//  RNFR - Rename From
	//
	else if (!strcmp(command, "RNFR")) {
#ifdef FTP_DEBUG
		Serial.print("RNFR");
		Serial.print(parameters);
#endif
		buf[0] = 0;
		if (strlen(parameters) == 0)
			client.println("501 No file name");
		else if (makePath(buf)) {
			if (!_fs.exists(buf))
				client.println("550 File " + String(parameters) + " not found");
			else {
#ifdef FTP_DEBUG
				Serial.println("Renaming " + String(buf));
#endif
				client.println(
						"350 RNFR accepted - file exists, ready for destination");
				rnfrCmd = true;
			}
		}
	}
	//
	//  RNTO - Rename To
	//
	else if (!strcmp(command, "RNTO")) {
		char path[ FTP_CWD_SIZE];
		char dir[ FTP_FIL_SIZE];
		if (strlen(buf) == 0 || !rnfrCmd)
			client.println("503 Need RNFR before RNTO");
		else if (strlen(parameters) == 0)
			client.println("501 No file name");
		else if (makePath(path)) {
			if (_fs.exists(path))
				client.println("553 " + String(parameters) + " already exists");
			else {
#ifdef FTP_DEBUG
				Serial.println(
						"Renaming " + String(buf) + " to " + String(path));
#endif
				if (_fs.rename(buf, path))
					client.println("250 File successfully renamed or moved");
				else
					client.println("451 Rename/move failure");

