pulsar85/esp32FTPServer/ESPFtpServer.cpp
			}
		}
		rnfrCmd = false;
	}

	///////////////////////////////////////
	//                                   //
	//   EXTENSIONS COMMANDS (RFC 3659)  //
	//                                   //
	///////////////////////////////////////

	//
	//  FEAT - New Features
	//
	else if (!strcmp(command, "FEAT")) {
#ifdef FTP_DEBUG
		Serial.println("FEAT");
#endif
		client.println("211-Extensions suported:");
		client.println(" MLSD");
		client.println("211 End.");
	}
	//
	//  MDTM - File Modification Time (see RFC 3659)
	//
	else if (!strcmp(command, "MDTM")) {
#ifdef FTP_DEBUG
		Serial.println("MDTM");
#endif
		client.println("550 Unable to retrieve time");
	}

	//
	//  SIZE - Size of the file
	//
	else if (!strcmp(command, "SIZE")) {
#ifdef FTP_DEBUG
		Serial.println("SIZE");
#endif
		char path[ FTP_CWD_SIZE];
		if (strlen(parameters) == 0)
			client.println("501 No file name");
		else if (makePath(path)) {
			file = _fs.open(path, "r");
			if (!file)
				client.println("450 Can't open " + String(parameters));
			else {
				client.println("213 " + String(file.size()));
				file.close();
			}
		}
	}
	//
	//  SITE - System command
	//
	else if (!strcmp(command, "SITE")) {
		client.println("500 Unknow SITE command " + String(parameters));
	}
	//
	//  Unrecognized commands ...
	//
	else
		client.println("500 Unknow command");

	return true;
}

boolean FtpServer::dataConnect() {
	unsigned long startTime = millis();
	//wait 5 seconds for a data connection
	if (!data.connected()) {
		while (!dataServer.hasClient() && millis() - startTime < 10000) {
			//delay(100);
			yield();
		}
		if (dataServer.hasClient()) {
			data.stop();
			data = dataServer.available();
#ifdef FTP_DEBUG
			Serial.println("ftpdataserver client....");
#endif

		}
	}

	return data.connected();

}

boolean FtpServer::doRetrieve() {
	if (data.connected()) {
		int16_t nb = file.readBytes(buf, FTP_BUF_SIZE);
		if (nb > 0) {
			data.write((uint8_t*) buf, nb);
			bytesTransfered += nb;
			return true;
		}
	}
	closeTransfer();
	return false;
}

boolean FtpServer::doStore() {
	// Avoid blocking by never reading more bytes than are available
	int navail = data.available();

	if (navail > 0) {
		// And be sure not to overflow buf.
		if (navail > FTP_BUF_SIZE)
			navail = FTP_BUF_SIZE;
		int16_t nb = data.read((uint8_t*) buf, navail);
		// int16_t nb = data.readBytes((uint8_t*) buf, FTP_BUF_SIZE );
		if (nb > 0) {
			// Serial.println( millis() << " " << nb << endl;
			file.write((uint8_t*) buf, nb);
			bytesTransfered += nb;
		}
	}
	if (!data.connected() && (navail <= 0)) {
		closeTransfer();
		return false;
	} else {
		return true;
	}
}

void FtpServer::closeTransfer() {
	uint32_t deltaT = (int32_t)(millis() - millisBeginTrans);
	if (deltaT > 0 && bytesTransfered > 0) {
		client.println("226-File successfully transferred");
		client.println(
				"226 " + String(deltaT) + " ms, "
						+ String(bytesTransfered / deltaT) + " kbytes/s");
	} else
		client.println("226 File successfully transferred");

	file.close();
	data.stop();
}

void FtpServer::abortTransfer() {
	if (transferStatus > 0) {
		file.close();
		data.stop();
		client.println("426 Transfer aborted");
#ifdef FTP_DEBUG
		Serial.println("Transfer aborted!");
#endif
	}
	transferStatus = 0;
}

// Read a char from client connected to ftp server
//
//  update cmdLine and command buffers, iCL and parameters pointers
//
//  return:
//    -2 if buffer cmdLine is full
//    -1 if line not completed
//     0 if empty line received
//    length of cmdLine (positive) if no empty line received 

int8_t FtpServer::readChar() {
	int8_t rc = -1;

	if (client.available()) {
		char c = client.read();
		// char c;
		// client.readBytes((uint8_t*) c, 1);
#ifdef FTP_DEBUG
		Serial.print(c);
#endif
		if (c == '\\')
			c = '/';
		if (c != '\r') {
			if (c != '\n') {
				if (iCL < FTP_CMD_SIZE)
					cmdLine[iCL++] = c;
				else
					rc = -2; //  Line too long
			} else {
				cmdLine[iCL] = 0;
				command[0] = 0;
				parameters = NULL;
				// empty line?
				if (iCL == 0)
					rc = 0;
				else {
					rc = iCL;
					// search for space between command and parameters
					parameters = strchr(cmdLine, ' ');
					if (parameters != NULL) {
						if (parameters - cmdLine > 4)
							rc = -2; // Syntax error
						else {
							strncpy(command, cmdLine, parameters - cmdLine);
							command[parameters - cmdLine] = 0;

							while (*(++parameters) == ' ')
								;
						}
					} else if (strlen(cmdLine) > 4)
						rc = -2; // Syntax error.
					else
						strcpy(command, cmdLine);
					iCL = 0;
				}
			}
		};
		if (rc > 0)
			for (uint8_t i = 0; i < strlen(command); i++)
				command[i] = toupper(command[i]);
		if (rc == -2) {
			iCL = 0;
			client.println("500 Syntax error");
		}
	}
	return rc;
}

// Make complete path/name from cwdName and parameters
//
// 3 possible cases: parameters can be absolute path, relative path or only the name
//
// parameters:
//   fullName : where to store the path/name
//
// return:
//    true, if done

boolean FtpServer::makePath(char * fullName) {
	return makePath(fullName, parameters);
}

boolean FtpServer::makePath(char * fullName, char * param) {
	if (param == NULL)
		param = parameters;

	// Root or empty?
	if (strcmp(param, "/") == 0 || strlen(param) == 0) {
		strcpy(fullName, "/");
		return true;
	}
	// If relative path, concatenate with current dir
	if (param[0] != '/') {
		strcpy(fullName, cwdName);
		if (fullName[strlen(fullName) - 1] != '/')
			strncat(fullName, "/", FTP_CWD_SIZE);
		strncat(fullName, param, FTP_CWD_SIZE);
	} else
		strcpy(fullName, param);
	// If ends with '/', remove it
	uint16_t strl = strlen(fullName) - 1;
	if (fullName[strl] == '/' && strl > 1)
		fullName[strl] = 0;
	if (strlen(fullName) < FTP_CWD_SIZE)
		return true;

	client.println("500 Command line too long");
	return false;
}

// Calculate year, month, day, hour, minute and second
//   from first parameter sent by MDTM command (YYYYMMDDHHMMSS)
//
// parameters:
//   pyear, pmonth, pday, phour, pminute and psecond: pointer of
//     variables where to store data
//
// return:
//    0 if parameter is not YYYYMMDDHHMMSS
//    length of parameter + space

uint8_t FtpServer::getDateTime(uint16_t * pyear, uint8_t * pmonth,
		uint8_t * pday, uint8_t * phour, uint8_t * pminute, uint8_t * psecond) {
	char dt[15];

	// Date/time are expressed as a 14 digits long string
	//   terminated by a space and followed by name of file
	if (strlen(parameters) < 15 || parameters[14] != ' ')
		return 0;
	for (uint8_t i = 0; i < 14; i++)
		if (!isdigit(parameters[i]))
			return 0;

	strncpy(dt, parameters, 14);
	dt[14] = 0;
	*psecond = atoi(dt + 12);
	dt[12] = 0;
	*pminute = atoi(dt + 10);
	dt[10] = 0;
	*phour = atoi(dt + 8);
	dt[8] = 0;
	*pday = atoi(dt + 6);
	dt[6] = 0;
	*pmonth = atoi(dt + 4);
	dt[4] = 0;
	*pyear = atoi(dt);
	return 15;
}

// Create string YYYYMMDDHHMMSS from date and time
//
// parameters:
//    date, time 
//    tstr: where to store the string. Must be at least 15 characters long
//
// return:
//    pointer to tstr

char * FtpServer::makeDateTimeStr(char * tstr, uint16_t date, uint16_t time) {
	sprintf(tstr, "%04u%02u%02u%02u%02u%02u", ((date & 0xFE00) >> 9) + 1980,
			(date & 0x01E0) >> 5, date & 0x001F, (time & 0xF800) >> 11,
			(time & 0x07E0) >> 5, (time & 0x001F) << 1);
	return tstr;
}
